/****************************************************************************
	*	@功能	：	存放永久循环执行的函数
	*	@函数列表：
	*	1.	void loop_uart(void) -- 循环接收处理串口数据
 ****************************************************************************/

/***********************************************
	函数名称:		loop_sensor() 
	功能介绍:		循环读取传感器的值
	函数参数:		无
	返回值:			无
 ***********************************************/
void loop_sensor(void) {
	static u32 systick_ms_bak=0;
	if(millis() - systick_ms_bak >= 1000) {
		systick_ms_bak = millis();
		sensor_read_ultrasonic(1);
	}
}
