/****************************************************************************
	*	@功能	：	存放永久循环执行的函数
	*	@函数列表：
	*	1.	void loop_key(void) -- 循环检测按键状态
 ****************************************************************************/

/***********************************************
	函数名称:		loop_key() 
	功能介绍:		循环检测按键状态
	函数参数:		无
	返回值:			无
 ***********************************************/
void loop_key(void) {
	static u32 systick_ms_bak = 0;

/*****************按键1按下检测*****************/
	if(KEY1==0){
		delay(50);
		if(KEY1==0){
/*****************按键1长按检测*****************/
			systick_ms_bak = millis();
			while(KEY1==0){
				if(millis() - systick_ms_bak >= 500) {
/*****************按键1长按执行*****************/
/***********************************************/
				}
			}
/*****************按键1松开执行*****************/
/***********************************************/
/*****************按键1单次检测*****************/
			if(millis() - systick_ms_bak < 500) {
/*****************按键1单次执行*****************/
				motor1_speed+=10;
				if(motor1_speed>1000)	motor1_speed=1000;
				motor1_SetSpeed(motor1_speed);
				motor2_speed+=10;
				if(motor2_speed>1000)	motor2_speed=1000;
				motor2_SetSpeed(motor2_speed);
/***********************************************/
			}
		}
	}
	
/*****************按键2按下检测*****************/
	if(KEY2==0){
		delay(50);
		if(KEY2==0){
/*****************按键2长按检测*****************/
			systick_ms_bak = millis();
			while(KEY2==0){
				if(millis() - systick_ms_bak >= 500) {
/*****************按键2长按执行*****************/
/***********************************************/
				}
			}
/*****************按键2松开执行*****************/
/***********************************************/
/*****************按键2单次检测*****************/
			if(millis() - systick_ms_bak < 500) {
/*****************按键2单次执行*****************/
				motor1_speed-=10;
				if(motor1_speed<-1000)	motor1_speed=-1000;
				motor1_SetSpeed(motor1_speed);
				motor2_speed-=10;
				if(motor2_speed<-1000)	motor2_speed=-1000;
				motor2_SetSpeed(motor2_speed);
/***********************************************/
			}
		}
	}
}
