/****************************************************************************
	*	@功能	：	存放初始化相关的函数
	*	@函数列表：
	*	1.	void setup_key(void) -- 初始化按键
	*	2.	void setup_motor(void) -- 初始化电机
 ****************************************************************************/

/***********************************************
	函数名称:		setup_key() 
	功能介绍:		初始化按键
	函数参数:		无
	返回值:			无
 ***********************************************/
void setup_key(void) {
	key_init();
}

/***********************************************
	函数名称:		setup_motor() 
	功能介绍:		初始化电机
	函数参数:		无
	返回值:			无
 ***********************************************/
void setup_motor(void) {
	motor1_speed = 0;
	motor2_speed = 0;
	motor1_SetSpeed(motor1_speed);
	motor2_SetSpeed(motor2_speed);
}
