# 1 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\ZL_KPZAR.ino"
/****************************************************************************
	*	@笔者	：	W
	*	@日期	：	2019年12月28日
	*	@所属	：	杭州众灵科技
	*	@论坛	：	www.ZL-robot.com
	*	@功能	：	ZL-KPZ控制板（AR版）模块例程9————2路电机驱动控制
	*	@函数列表：
	*	1.	void setup(void) -- 初始化函数
	*	2.	void loop(void) -- 主循环函数
 ****************************************************************************/

/*******全局变量定义*******/
u8 i=0;
int motor1_speed=0, motor2_speed=0;

void setup(void) { //ZL
 setup_key(); //初始化按键
 setup_motor(); //初始化电机相关设置
}
void loop(void) {
 loop_key(); //循环检测按键状态
}
# 1 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_key.ino"
/****************************************************************************

	*	@笔者	：	W

	*	@日期	：	2019年12月28日

	*	@所属	：	杭州众灵科技

	*	@论坛	：	www.ZL-robot.com

	*	@功能	：	存放按键相关的函数

	*	@函数列表：

	*	1.	void key_init(void) -- 初始化按键

 ****************************************************************************/
# 11 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_key.ino"
/*******按键管脚映射表*******/



/*******按键快捷指令表*******/



/***********************************************

	函数名称:		key_init() 

	功能介绍:		初始化按键

	函数参数:		无

	返回值:			无

 ***********************************************/
# 25 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_key.ino"
void key_init(void) {
 pinMode(A1,0x2); //设置引脚为输入模式
 pinMode(A2,0x2); //设置引脚为输入模式
}
# 1 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_loop.ino"
/****************************************************************************

	*	@笔者	：	W

	*	@日期	：	2019年12月28日

	*	@所属	：	杭州众灵科技

	*	@论坛	：	www.ZL-robot.com

	*	@功能	：	存放永久循环执行的函数

	*	@函数列表：

	*	1.	void loop_key(void) -- 循环检测按键状态

 ****************************************************************************/
# 11 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_loop.ino"
/***********************************************

	函数名称:		loop_key() 

	功能介绍:		循环检测按键状态

	函数参数:		无

	返回值:			无

 ***********************************************/
# 17 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_loop.ino"
void loop_key(void) {
 static u32 systick_ms_bak = 0;

/*****************按键1按下检测*****************/
 if(digitalRead(A1) /*读取按键1状态*/==0){
  delay(50);
  if(digitalRead(A1) /*读取按键1状态*/==0){
/*****************按键1长按检测*****************/
   systick_ms_bak = millis();
   while(digitalRead(A1) /*读取按键1状态*/==0){
    if(millis() - systick_ms_bak >= 500) {
/*****************按键1长按执行*****************/
/***********************************************/
    }
   }
/*****************按键1松开执行*****************/
/***********************************************/
/*****************按键1单次检测*****************/
   if(millis() - systick_ms_bak < 500) {
/*****************按键1单次执行*****************/
    motor1_speed+=10;
    if(motor1_speed>1000) motor1_speed=1000;
    motor1_SetSpeed(motor1_speed);
    motor2_speed+=10;
    if(motor2_speed>1000) motor2_speed=1000;
    motor2_SetSpeed(motor2_speed);
/***********************************************/
   }
  }
 }

/*****************按键2按下检测*****************/
 if(digitalRead(A2) /*读取按键2状态*/==0){
  delay(50);
  if(digitalRead(A2) /*读取按键2状态*/==0){
/*****************按键2长按检测*****************/
   systick_ms_bak = millis();
   while(digitalRead(A2) /*读取按键2状态*/==0){
    if(millis() - systick_ms_bak >= 500) {
/*****************按键2长按执行*****************/
/***********************************************/
    }
   }
/*****************按键2松开执行*****************/
/***********************************************/
/*****************按键2单次检测*****************/
   if(millis() - systick_ms_bak < 500) {
/*****************按键2单次执行*****************/
    motor1_speed-=10;
    if(motor1_speed<-1000) motor1_speed=-1000;
    motor1_SetSpeed(motor1_speed);
    motor2_speed-=10;
    if(motor2_speed<-1000) motor2_speed=-1000;
    motor2_SetSpeed(motor2_speed);
/***********************************************/
   }
  }
 }
}
# 1 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_motor.ino"
/****************************************************************************

	*	@笔者	：	W

	*	@日期	：	2019年12月28日

	*	@所属	：	杭州众灵科技

	*	@论坛	：	www.ZL-robot.com

	*	@功能	：	存放电机相关的函数

	*	@函数列表：

	*	1.	void motor1_SetSpeed(int Speed) -- 电机1速度控制

	*	2.	void motor2_SetSpeed(int Speed) -- 电机2速度控制

 ****************************************************************************/
# 12 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_motor.ino"
/*******电机控制指令表*******/





/***********************************************

	函数名称:		motor1_SetSpeed() 

	功能介绍:		电机1速度控制

	函数参数:		Speed 速度

	返回值:			无

 ***********************************************/
# 24 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_motor.ino"
void motor1_SetSpeed(int Speed) {
 if(Speed==0) {
  analogWrite(3,0);
  analogWrite(5,0);
 }
 else if(Speed>0) {
  Speed=Speed/5+55;
  analogWrite(3,Speed);
  analogWrite(5,0);
 } else {
  Speed=-1*Speed/5+55;
  analogWrite(3,0);
  analogWrite(5,Speed);
 }
}

/***********************************************

	函数名称:		motor2_SetSpeed() 

	功能介绍:		电机2速度控制

	函数参数:		Speed 速度

	返回值:			无

 ***********************************************/
# 46 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_motor.ino"
void motor2_SetSpeed(int Speed) {
 if(Speed==0) {
  analogWrite(6,0);
  analogWrite(9,0);
 }
 else if(Speed>0) {
  Speed=Speed/5+55;
  analogWrite(6,Speed);
  analogWrite(9,0);
 } else {
  Speed=-1*Speed/5+55;
  analogWrite(6,0);
  analogWrite(9,Speed);
 }
}
# 1 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_setup.ino"
/****************************************************************************

	*	@笔者	：	W

	*	@日期	：	2019年12月28日

	*	@所属	：	杭州众灵科技

	*	@论坛	：	www.ZL-robot.com

	*	@功能	：	存放初始化相关的函数

	*	@函数列表：

	*	1.	void setup_key(void) -- 初始化按键

	*	2.	void setup_motor(void) -- 初始化电机

 ****************************************************************************/
# 12 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_setup.ino"
/***********************************************

	函数名称:		setup_key() 

	功能介绍:		初始化按键

	函数参数:		无

	返回值:			无

 ***********************************************/
# 18 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_setup.ino"
void setup_key(void) {
 key_init();
}

/***********************************************

	函数名称:		setup_motor() 

	功能介绍:		初始化电机

	函数参数:		无

	返回值:			无

 ***********************************************/
# 28 "F:\\Desktop\\03-源码例程\\例程09————2路电机驱动控制\\ZL_KPZAR\\z_setup.ino"
void setup_motor(void) {
 motor1_speed = 0;
 motor2_speed = 0;
 motor1_SetSpeed(motor1_speed);
 motor2_SetSpeed(motor2_speed);
}
